In [2]:
# import necessary libraries
import pandas as pd

In [6]:
# create a dataframe
df = pd.DataFrame({'name':['Elise Mccann', 'Aiden Berger', 'Elle Kelley']})
df

           name
0  Elise Mccann
1  Aiden Berger
2   Elle Kelley

In [3]:
# extract first name and last name
df['first_name'] = df['name'].str.split(' ', expand = True)[0]
df['last_name'] = df['name'].str.split(' ', expand = True)[1]

df

           name first_name last_name
0  Elise Mccann      Elise    Mccann
1  Aiden Berger      Aiden    Berger
2   Elle Kelley       Elle    Kelley

### Split (explode) pandas dataframe string entry to separate rows

In [10]:
dx = pd.DataFrame({'name':['Elise Mccann', 'Aiden Berger', 'Elle Kelley'],
                 'Participation in': ['Chess,Football','Cricket','Foosball,Carrom']})
dx

           name Participation in
0  Elise Mccann   Chess,Football
1  Aiden Berger          Cricket
2   Elle Kelley  Foosball,Carrom

In [11]:
def comma_separator(df, col):
    constraints=df[col].apply(lambda x: str(x).split(',')).tolist()
    df_new=pd.DataFrame(constraints, index=df['name'])
    df_new=df_new.apply(pd.Series).stack()
    df_new=pd.DataFrame(df_new)
    df_new.reset_index(inplace=True)
    df_new=df_new[['name',0]]
    df_new.columns=['name','Participated in'] 
    df_new=df_new[~(df_new['Participated in']=='None')]
    return df_new

In [12]:
comma_separator(dx,'Participation in')

           name Participated in
0  Elise Mccann           Chess
1  Elise Mccann        Football
2  Aiden Berger         Cricket
3   Elle Kelley        Foosball
4   Elle Kelley          Carrom